import { AtHandle } from "@/ui/AtHandle"
import Link from "next/link"

export const Footer = () => {
  return (
    <footer className="mx-auto flex w-full max-w-7xl flex-col gap-16 px-6 py-6 lg:py-32">
      <section className="flex flex-col gap-6 lg:flex-row lg:items-center lg:gap-16">
        <h3 className="text-xl font-bold text-zinc-800">Contato</h3>

        <AtHandle rounded />

        <WhatsApp />

        <Email />
      </section>

      <div className="h-[500px] w-full rounded bg-zinc-300">
        <iframe src="https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d15429.897385791099!2d-39.0332874!3d-14.7986126!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x7390bbf0d2f194b%3A0x120a76a87f0d1935!2sCurso%20de%20Reda%C3%A7%C3%A3o%20Acelera%20Enem!5e0!3m2!1spt-BR!2sbr!4v1714681196335!5m2!1spt-BR!2sbr" width="600" height="450" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>
      </div>
      
      <div className="flex items-center gap-2 font-semibold text-black">
        <PinIcon />
        {
          <a target=”_blank” href="https://www.google.com/maps/place/Curso+de+Redação+Acelera+Enem/@-14.7986126,-39.0332874,15z/data=!4m6!3m5!1s0x7390bbf0d2f194b:0x120a76a87f0d1935!8m2!3d-14.7987886!4d-39.0334966!16s%2Fg%2F11s46qyjgf?entry=ttu">
            Rua Dom Pedro II, 54 - Centro, Ilhéus - BA (Galeria It'art - 1º Andar) - TOCA
          </a>
        }
      </div>

      <p className="text-zinc-600">
        ACELERA ENEM CURSOS PREPARATORIOS LTDA | CNPJ: 51.119.706/0001-08
      </p>

      <hr className="w-full text-zinc-400" />

      <div className="flex flex-col items-center gap-6 lg:flex-row lg:gap-16">
        <Link href="/">Política de Privacidade</Link>
        <Link href="/">Termos de Uso</Link>
        <Link href="/">Termos e Condições de Planos</Link>
      </div>
    </footer>
  )
}

function WhatsApp() {
  const phone = "(73) 99812-1251"
  const phoneNumer = phone.replace(/^[0-9]*$/gi, "")
  const link = `/${phoneNumer}`

  return (
    <a
      href={link}
      className="flex w-max items-center gap-2 rounded-full bg-[#25D366] px-3 py-1.5 text-black"
    >
      <WhatsAppIcon />
      {phone}
    </a>
  )
}

function Email() {
  const email = "contato@aceleraenem.com"
  const link = `/`

  return (
    <a
      href={link}
      className="flex w-max items-center gap-2 rounded-full bg-zinc-300 px-3 py-1.5 text-black"
    >
      <MailIcon />
      {email}
    </a>
  )
}

function MailIcon() {
  return (
    <svg
      width="20"
      height="20"
      viewBox="0 0 20 20"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <path
        d="M3 4C2.46957 4 1.96086 4.21071 1.58579 4.58579C1.21071 4.96086 1 5.46957 1 6V7.161L9.441 11.382C9.61456 11.4688 9.80595 11.514 10 11.514C10.194 11.514 10.3854 11.4688 10.559 11.382L19 7.162V6C19 5.46957 18.7893 4.96086 18.4142 4.58579C18.0391 4.21071 17.5304 4 17 4H3Z"
        fill="currentColor"
      />
      <path
        d="M19 8.83887L11.23 12.7239C10.8481 12.9148 10.427 13.0143 10 13.0143C9.57301 13.0143 9.1519 12.9148 8.77 12.7239L1 8.83887V13.9999C1 14.5303 1.21071 15.039 1.58579 15.4141C1.96086 15.7892 2.46957 15.9999 3 15.9999H17C17.5304 15.9999 18.0391 15.7892 18.4142 15.4141C18.7893 15.039 19 14.5303 19 13.9999V8.83887Z"
        fill="currentColor"
      />
    </svg>
  )
}

function WhatsAppIcon() {
  return (
    <svg
      width="20"
      height="20"
      viewBox="0 0 20 20"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <g clipPath="url(#clip0_3_400)">
        <path
          d="M14.7988 11.4922C14.7598 11.4735 13.3018 10.7555 13.0427 10.6623C12.9369 10.6243 12.8236 10.5872 12.7031 10.5872C12.5062 10.5872 12.3408 10.6853 12.212 10.878C12.0663 11.0945 11.6254 11.6099 11.4892 11.7639C11.4714 11.7842 11.4471 11.8085 11.4326 11.8085C11.4195 11.8085 11.1939 11.7156 11.1256 11.6859C9.56147 11.0065 8.37426 9.37265 8.21147 9.09713C8.18822 9.05752 8.18725 9.03954 8.18705 9.03954C8.19277 9.01856 8.24536 8.96584 8.27251 8.93863C8.35192 8.86006 8.43796 8.75649 8.52121 8.65629C8.56062 8.60882 8.6001 8.56129 8.63887 8.51649C8.75965 8.37597 8.81342 8.26687 8.87575 8.14051L8.90842 8.07486C9.06062 7.77246 8.93062 7.51726 8.88861 7.43486C8.85413 7.3659 8.23848 5.88006 8.17303 5.72395C8.01562 5.34726 7.80764 5.17188 7.51861 5.17188C7.49179 5.17188 7.51861 5.17187 7.40614 5.17662C7.26919 5.18239 6.52342 5.28058 6.19368 5.48843C5.844 5.70889 5.25244 6.41162 5.25244 7.64746C5.25244 8.75973 5.95829 9.80993 6.26134 10.2093C6.26887 10.2194 6.2827 10.2399 6.30277 10.2692C7.46335 11.9641 8.91017 13.2203 10.3769 13.8062C11.7889 14.3702 12.4575 14.4354 12.8376 14.4354H12.8377C12.9974 14.4354 13.1253 14.4228 13.2381 14.4117L13.3096 14.4049C13.7974 14.3617 14.8694 13.8062 15.1132 13.1286C15.3053 12.5949 15.3559 12.0118 15.2282 11.8002C15.1406 11.6563 14.9898 11.5839 14.7988 11.4922Z"
          fill="currentColor"
        />
        <path
          d="M10.1775 0C4.76089 0 0.354141 4.37364 0.354141 9.74955C0.354141 11.4883 0.819465 13.1903 1.70096 14.6799L0.0137512 19.6569C-0.0176774 19.7497 0.0056992 19.8523 0.0743356 19.9221C0.123881 19.9727 0.191089 20 0.259725 20C0.286024 20 0.312517 19.996 0.338362 19.9878L5.52797 18.3387C6.9481 19.0975 8.55317 19.498 10.1776 19.498C15.5937 19.4981 20 15.1249 20 9.74955C20 4.37364 15.5937 0 10.1775 0ZM10.1775 17.4671C8.64901 17.4671 7.16856 17.0258 5.89596 16.1907C5.85317 16.1626 5.80349 16.1482 5.75349 16.1482C5.72706 16.1482 5.70057 16.1522 5.67479 16.1604L3.07511 16.9868L3.91434 14.5108C3.94148 14.4307 3.92791 14.3423 3.87791 14.274C2.90882 12.9499 2.39654 11.3854 2.39654 9.74955C2.39654 5.49351 5.88706 2.03091 10.1775 2.03091C14.4673 2.03091 17.9575 5.49351 17.9575 9.74955C17.9575 14.0051 14.4675 17.4671 10.1775 17.4671Z"
          fill="currentColor"
        />
      </g>
      <defs>
        <clipPath id="clip0_3_400">
          <rect width="20" height="20" fill="white" />
        </clipPath>
      </defs>
    </svg>
  )
}

function PinIcon() {
  return (
    <svg
      width="20"
      height="20"
      viewBox="0 0 20 20"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      className="shrink-0"
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M9.69 18.933L9.693 18.934C9.89 19.02 10 19 10 19C10 19 10.11 19.02 10.308 18.934L10.31 18.933L10.316 18.93L10.334 18.922C10.4289 18.8779 10.5226 18.8312 10.615 18.782C10.801 18.686 11.061 18.542 11.372 18.349C11.992 17.965 12.817 17.383 13.646 16.584C15.302 14.988 17 12.493 17 9C17 8.08075 16.8189 7.1705 16.4672 6.32122C16.1154 5.47194 15.5998 4.70026 14.9497 4.05025C14.2997 3.40024 13.5281 2.88463 12.6788 2.53284C11.8295 2.18106 10.9193 2 10 2C9.08075 2 8.1705 2.18106 7.32122 2.53284C6.47194 2.88463 5.70026 3.40024 5.05025 4.05025C4.40024 4.70026 3.88463 5.47194 3.53284 6.32122C3.18106 7.1705 3 8.08075 3 9C3 12.492 4.698 14.988 6.355 16.584C7.04875 17.2503 7.8106 17.8419 8.628 18.349C8.94459 18.5456 9.27029 18.7271 9.604 18.893L9.666 18.922L9.684 18.93L9.69 18.933ZM10 11.25C10.5967 11.25 11.169 11.0129 11.591 10.591C12.0129 10.169 12.25 9.59674 12.25 9C12.25 8.40326 12.0129 7.83097 11.591 7.40901C11.169 6.98705 10.5967 6.75 10 6.75C9.40326 6.75 8.83097 6.98705 8.40901 7.40901C7.98705 7.83097 7.75 8.40326 7.75 9C7.75 9.59674 7.98705 10.169 8.40901 10.591C8.83097 11.0129 9.40326 11.25 10 11.25Z"
        fill="currentColor"
      />
    </svg>
  )
}
